<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of WhatsApp.</string>
	<key>Identifier</key>
	<string>Belga.download.WhatsApp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WhatsApp</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://scontent-bru2-1.xx.fbcdn.net/v/t39.16592-6/10000000_1238834090011742_6253674245314266018_n.dmg/files-WhatsApp.dmg?_nc_cat=103&amp;ccb=1-7&amp;_nc_sid=ab91e1&amp;_nc_ohc=dhw9J18kl08AX8BQ-4c&amp;_nc_ht=scontent-bru2-1.xx&amp;oh=00_AfAWqqandGjzETyJXmxa53T12-5-Gavsc09ATbnNvGfX2Q&amp;oe=63C98B70</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/WhatsApp.app</string>
				<key>requirement</key>
				<string>identifier WhatsApp and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "57T9237FN3"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/WhatsApp.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
